title: Appverif.exe DLL side-loading attack to spawn new process
id: 5e491e78-0d48-4ee6-9b0a-82d1403bb131
status: experimental
description: This rule is meant to detect when appverif.exe is used in a DLL side-loading attack to gain code execution to bypass application whitelisting. Detects when appverif.exe spawns a new process
references:
    - https://www.fatrodzianko.com/2020/02/15/dll-side-loading-appverif-exe/
tags:
    - attack.execution
    - attack.T1073
author:@fatrodzianko
date: 2020/02/15
logsource:                     
    category: process_creation  
    product: windows            
detection:
    selection:
        ParentImage: *\appverif.exe
		Image:
			- '*\cmd.exe'
            - '*\powershell.exe'
            - '*\wscript.exe'
            - '*\cscript.exe'
            - '*\sh.exe'
            - '*\bash.exe'
            - '*\reg.exe'
            - '*\regsvr32.exe'
            - '*\BITSADMIN*
			- '*\powershell.exe'
			- '*\iexplore.exe'
			- '*\calc.exe'
			- '*\notepad.exe'
			- '*\svchost.exe'
			- '*\rundll32.exe'
			- '*\wmic.exe'
			- '*\msiexec.exe'
			- '*\msbuild.exe'
			
    condition: selection
fields:
    - unknown
falsepositives:
    - Unknown
level: high
